Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиШтатногоРасписания/НастройкиШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиШтатногоРасписания</name>
  <resources>
    <name>ИспользоватьВилкуСтавокВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИндексациюШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьИсториюИзмененияШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьШтатноеРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьВилкуСтавокВШтатномРасписании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьИсториюИзмененияШтатногоРасписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НеИспользоватьШтатноеРасписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПроверятьНаСоответствиеШтатномуРасписаниюАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПредставлениеТарифовИНадбавок</name>
    <type>
      <types>EnumRef.ПредставлениеТарифовИНадбавок</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИспользоватьСтатьиФинансированияВКадровомУчете</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьБронированиеПозиций</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДнейСохраненияБрони</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
</mdclass:InformationRegister>

Тест_ЗУП_31_КОРП/src/InformationRegisters/НастройкиШтатногоРасписания/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	ИспользоватьНачислениеЗарплаты = Константы.ИспользоватьНачислениеЗарплаты.Получить();
	
	ЭтотОбъект[0].НеИспользоватьШтатноеРасписание = Не ЭтотОбъект[0].ИспользоватьШтатноеРасписание;
	ЭтотОбъект[0].НеИспользоватьИсториюИзмененияШтатногоРасписания = Не ЭтотОбъект[0].ИспользоватьИсториюИзмененияШтатногоРасписания;
	ЭтотОбъект[0].НеИспользоватьВилкуСтавокВШтатномРасписании = ИспользоватьНачислениеЗарплаты И Не ЭтотОбъект[0].ИспользоватьВилкуСтавокВШтатномРасписании;
	
	ЭтотОбъект[0].ИспользоватьИндексациюШтатногоРасписания = ПолучитьФункциональнуюОпцию("ИспользоватьИндексациюЗаработка") И ЭтотОбъект[0].ИспользоватьИсториюИзмененияШтатногоРасписания;
	
	Если Не ЭтотОбъект[0].ИспользоватьШтатноеРасписание Тогда
		ЭтотОбъект[0].ИспользоватьБронированиеПозиций = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
		
	Если Константы.РаботаВБюджетномУчреждении.Получить() Тогда
		ЭтотОбъект[0].ИспользоватьРазрядыКатегорииКлассыДолжностейИПрофессийВШтатномРасписании = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
